app/Controllers/GerenciaAnam.php

SELECT *
FROM `anamnese`
WHERE `anamnese`.`id` = '12'
---
    public function edit($id)
    {

        return view('anamneseEdit', ['anamnese' => $this->anamModel->find($id)]);

INSERT INTO `user_actions` (`id_usuario`, `nome`, `action`, `timestamp`) VALUES ('21', 'João Pedro', 'Criou uma nova anamnese', '2023-06-24 14:45:27')
---
    private function registerUserAction($action)
    {
        $id_usuario = $this->session->get('id_usuario');
        $nome = $this->session->get('nome');

        $data = [
            'id_usuario' => $id_usuario,
            'nome' => $nome,
            'action' => $action,
            'timestamp' => date('Y-m-d H:i:s')
        ];

        $this->userActionModel->insert($data);