app/Controllers/GerenciaPront.php

SELECT *
FROM `prontuario`
WHERE `prontuario`.`id` = '17'
---
    public function edit($id)
    {

        return view('prontuarioEdit', ['prontuario' => $this->prontModel->find($id)]);

INSERT INTO `user_actions` (`id_usuario`, `nome`, `action`, `timestamp`) VALUES ('21', 'João Pedro', 'Criou um novo prontuário', '2023-06-24 14:36:12')
---
    private function registerUserAction($action)
    {
        $id_usuario = $this->session->get('id_usuario');
        $nome = $this->session->get('nome');

        $data = [
            'id_usuario' => $id_usuario,
            'nome' => $nome,
            'action' => $action,
            'timestamp' => date('Y-m-d H:i:s')
        ];

        $this->userActionModel->insert($data);