app/Controllers/Login.php

	public function index()
	{
    $data['msg'] = '';

    if ($this->request->getMethod() === 'post') {
        $matricula = $this->request->getPost('matricula');
        $senha = $this->request->getPost('senha');

        $usuarioModel = model('UsuarioModel');
        $buscaUsuario = $usuarioModel->where('matricula', $matricula)->first();
---
SELECT *
FROM `usuarios`
WHERE `matricula` = '22964'
 LIMIT 1