app/Controllers/Usuarios.php

    public function index()
    {

        $usuarios = $this->usuarioModel->select('id, nome, matricula, perfil')->orderBy('id', 'DESC')->get()->getResult();
---
SELECT `id`, `nome`, `matricula`, `perfil`
FROM `usuarios`
ORDER BY `id` DESC

    public function actionUser()
    {

        $user_actions = $this->userActionModel->select('id, id_usuario, nome, action, timestamp')->orderBy('timestamp', 'DESC')->get()->getResult();
---
SELECT `id`, `id_usuario`, `nome`, `action`, `timestamp`
FROM `user_actions`
ORDER BY `timestamp` DESC